CDNozzle/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
outlet
{
    type            patch;
    physicalType    patch;
    nFaces          19;
    startFace       3644;
}

inlet
{
    type            patch;
    physicalType    patch;
    nFaces          19;
    startFace       3663;
}

wedge0
{
    type            wedge;
    physicalType    patch;
    nFaces          1881;
    startFace       3682;
}

nozzle
{
    type            wall;
    physicalType    patch;
    nFaces          99;
    startFace       5563;
}

wedge1
{
    type            wedge;
    physicalType    patch;
    nFaces          1881;
    startFace       5662;
}

)


// ************************************************************************* //
