CDNozzle/case/0/inputs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
speed                   (0 0 0); // m/s, initial condition 
total_temperature       55.5556; // Kelvin
total_pressure          6894.76; // Pascals
exit_pressure           6136.3364; // Pascals total/exit = 0.89 
// exit_pressure           5171.07; // Pascals total/exit = 0.75
// exit_pressure           1103.1616; // Pascals total/exit = 0.16
// turbulence model
turbulentKE             1000; // k
turbulentEpsilon        25000; // epsilon

// ************************************************************************* //
